<template>
  <div class="guide">
    <div class="agree-box">
      <div class="agree-content">
        <div class="img-box">
          <img src="@/assets/images/ecer-logo.png" alt="" />
        </div>
        <div class="main-tit">宜选建站服务协议</div>
        <div class="scroll-box">
          <div class="sub-tit">感谢您使用北京环球驿道科技有限公司提供的产品和服务。</div>
          <div class="l-box">
            在完成注册程序或以任何方式使用宜选建站平台服务前，请您务必仔细阅读并透彻理解本宜选建站平台服务协议(以下或简称“服务协议”)，在确认充分理解后选择接受或不接受本服务协议；一旦您完成“同意条款并注册”或开始以其他方式使用宜选服务，即表明您已阅读并同意受本服务协议的约束。如您不同意本服务协议或其中任何条款约定，您应不再进行下一步或停止注册程序。
            宜选再次提示您审慎阅读、充分理解各条款内容，特别是限制或免除责任的相应条款，限制或免除责任条款可能会以加粗或其他醒目形式提示您注意。
          </div>
          <div class="l-tit">一、签约主体以及协议范围</div>
          <div class="l-box">
            1.1.宜选建站平台服务协议是您与北京环球驿道科技有限公司（“宜选”或者“我们”）就使用宜选建站平台服务（包含为您提供网站页面信息浏览、账户注册服务等，以下称“本服务”）而订立的有效合约；您了解并同意该合约北京环球驿道科技有限公司可以授权给其母公司、同一母公司的兄弟公司、子公司、分公司或其它实际的同一受益人。
          </div>
          <div class="l-tit">二、账户的注册、使用与安全</div>
          <div class="sub-tit">2.1.注册的资格</div>
          <p>
            2.1.1.您确认，在您完成注册程序或以其他宜选允许的方式实际使用本服务时，您应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织（以下或简称为“您”）。
          </p>
          <p>
            2.1.2.若您是未成年人或限制民事行为能力人，则您不具备前述主体资格，您及您的监护人应承担因您的不当注册行为而导致的一切后果。
          </p>
          <p>
            2.1.3.您还需确保您不是任何国家、国际组织或者地域实施的贸易限制、制裁或其他法律、规则限制的对象，否则您可能无法正常注册及使用宜选服务。
          </p>
          <div class="sub-tit">2.2.账户注册</div>
          <div class="l-box">
            <p>
              2.2.1.当您按照注册页面提示填写信息、阅读并同意本服务协议且完成全部注册程序后，您可获得宜选建站账户并成为宜选建站的用户。
            </p>
            <p>
              2.2.2.您可选择通过设置登陆手机号码并完成动态验证、授权使用第三方账户关联注册或宜选提供的其他注册方式，完成宜选用户账户的注册。您理解并同意，当提及您的宜选建站账户或者账号时，实际是指上述账户名称与密码、登陆手机号、被授权的第三方账户或在用户界面内归属在“账户”或“账号”下的其他信息的统称。
            </p>
            <p>
              2.2.3.您设置的账户名不得违反国家法律法规、公序良俗、社会公德、宜选的管理规范或容易引起您与宜选身份的混淆，否则您的账户可能不能注册成功或宜选有权经通知您后予以注销。
            </p>
            <p>
              2.2.4.您应当按照法律法规要求或按相应页面的提示，准确提供并及时更新您的账户信息，以使之真实、及时、完整和准确。如您提供的资料错误、不实、过时或不完整的，宜选可以向您发出询问及/或要求改正的通知，您应按照宜选的要求配合提供或者更新相关资料。因您填写的信息、资料不真实、不及时、不完整或不准确的，您应承担您不能使用宜选建站账户（不能注册成功、或账户被冻结、注销）或您在使用过程中的后果和损失。
            </p>
            <p>
              2.2.5.通常情况下，您的宜选建站账户是您在宜选建站平台进行一切活动的唯一身份标识，除非另有约定，每一个宜选建站账户都可以在本网站独立开展活动。但在下列情形下，宜选有权根据自己的判断，对同一及/或关联法律主体拥有的多个宜选建站账户进行统一处理，如根据不同宜选建站账户在注册、登录、使用中的关联信息，宜选判断其实际为同一用户。关联信息举例：同一手机号、同一设备、同一地址等。
            </p>
          </div>
          <div class="sub-tit">2.3.账户的使用和安全</div>
          <div class="l-box">
            <p>
              2.3.1.您有权使用您设定的账户登录宜选建站平台，进而使用宜选提供的云服务。您知悉并同意，宜选有权不时变更、暂停或取消任何一项云服务（包括产品种类增加或减少、服务内容的调整、版本升级等）或整个云服务，或不时变更、暂停或取消云服务的某种特性或功能，或者不时变更、暂停或取消云服务的使用方式及有关云服务内容。该等变更、暂停或取消将在宜选官网上公布，以便通知到您。您有义务及时查收并透彻理解相关调整内容，如您不同意变更后的任何条款，请勿继续购买或使用相关云服务。如您使用宜选提供的云服务，即视为您同意遵守届时公示的服务协议及该具体云服务服务协议的最新版本及其任何条款。
            </p>
            <p>
              2.3.2.宜选可能会以邮件、站内信、短信或电话等方式通知您相关云服务进展情况以及提示您进行下一步的操作。在服务过程中您应当及时登录到宜选建站账户查看和进行交易操作。
            </p>
            <p>2.3.3.一个宜选建站账户仅能对应唯一的法律主体。除非有法律明文规定、司法裁定或者经宜选</p>
            <p>
              2.3.4.您的账户信息由您自行设置并由您保管，您须对您的宜选建站账户和密码、手机验证码及其他与账户相关的信息、资料予以保密。您需确保您在每个上网时段结束时，以正确步骤离开网站。
            </p>
            <p>
              2.3.5.如发现他人未经授权使用您的宜选建站账户，您应立即通知宜选；宜选将协助您冻结账户、更改密码或进行其他安全设置；您理解宜选对您的请求采取行动需要合理时间，宜选对在采取行动前已经产生的以及由您引发的后果（包括但不限于您的任何损失）不承担任何责任。
            </p>
            <p>2.3.6.宜选亦会在网站服务端采取合理的技术措施保障账户的安全。</p>
          </div>
          <div class="l-tit">三、账户的冻结、注销及申诉</div>
          <div class="sub-tit">3.1.账户的冻结</div>
          <div class="l-box">
            <p>
              您的宜选建站账户（全部或部分权限或功能）在如下情况可能被冻结（例如，宜选建站账户被限制登陆；被限制资金转出功能等），宜选将通过邮件、站内信、短信或电话等方式通知您：
            </p>
            <p>
              3.1.1.基于宜选建站平台或云服务运行和交易安全的需要，如您发生或可能发生破坏或试图破坏宜选或宜选关联公司公平交易环境或正常交易秩序的，或任何使用含有宜选或宜选关联公司名称、品牌且对他人有误导嫌疑或任何使用某种中英文(全称或简称)、数字、域名等意图表示或映射与宜选或其关联公司具有某种关联的；
            </p>
            <p>3.1.2.违反本服务协议、宜选建站平台的相关规则、规范、服务说明以及其他服务协议/条款的；</p>
            <p>3.1.3.违反国家法律、法规、政策、法律文书的规定的；</p>
            <p>3.1.4.您遭到他人投诉，且对方已经提供了相关证据的，而您未按照我们的要求提供相反证据的；</p>
            <p>3.1.5.宜选根据合理分析判断您的账户操作、收益、兑换等存在异常的；</p>
            <p>3.1.6.国家有权机关要求进行的冻结的；</p>
            <p>3.1.7.宜选合理判断，同一用户发生与如上行为性质相同或产生如上类似风险的其他情况的。</p>
          </div>
          <div class="sub-tit">3.2.账户的注销</div>
          <div class="l-box">
            <p>3.2.1.出现以下情形之一的，您的宜选账号将被注销：</p>
            <p>
              3.2.1.1.
              宜选依据您本人提交的账号注销申请，依照法律的规定和账户注销流程，处理您提交的注销请求并完成账号注销的。
            </p>
            <p>
              3.2.1.2.当出现如上第3.1条情形且情形严重的，或基于国家有权机关的要求，宜选对您的相关宜选建站账户进行注销，宜选将通过邮件、短信、电话或其他适宜的方式通知您。
            </p>
            <p>
              3.2.1.3.当您连续12个月未通过账户登录过宜选建站平台（含账户冻结期间），且您的账户下不存在任何未到期的云服务，宜选有权（但无义务）注销您的账户。
            </p>
            <p>3.2.2.您理解并同意，账户一经注销，您将：</p>
            <p>3.2.2.1无法再次登录宜选官网、宜选建站平台、会员中心、公众号等；</p>
            <p>3.2.2.2无法访问网站管理系统；</p>
            <p>3.2.2.3无法进行依赖于账户权限进行的其他操作；</p>
            <p>3.2.2.4无法找回该账户下的个人信息、交易记录、业务数据、历史信息等。</p>
            <p>3.2.2.5但账户注销并不代表您在该账户注销前的所有账户行为和相关责任得到豁免或减轻。</p>
            <p>3.2.3账户注销后，宜选将：</p>
            <p>
              3.2.3.1无权继续收集、存储和使用您的个人信息和数据，但法律法规另有要求的情形除外，例如：为了税务合规而保留相应的发票信息等；
            </p>
            <p>
              3.2.3.2有义务在遵守国家法律法规的前提下，保障您在该账户下的所有数据在实现日常业务功能所涉及的系统中不可被检索、访问；
            </p>
            <p>
              3.2.3.3账户注销不影响宜选在监管机关要求或其他合法场景下，依法确认该账户注销前的用户真实身份等相关义务的履行。
            </p>
          </div>
          <div class="sub-tit">3.3.申诉</div>
          <div class="l-box">
            <p>发生前述账户冻结或注销情况下，您应及时予以关注并可以按照程序进行申诉等后续操作：</p>
            <p>
              3.3.1.您通过申诉程序，向宜选申请解除上述冻结或注销的，为了您的账户安全，您应配合如实提供身份证明及相关资料，以及宜选要求的其他信息或文件，以便宜选进行核实。您应充分理解您的申诉并不必然被允许，宜选有权决定是否同意您的申诉请求。
            </p>
            <p>
              3.3.2.您理解并同意，如果您拒绝如实提供身份证明及相关资料，或未能通过宜选审核，宜选有权长期冻结该等账户且长期限制账户部分或全部功能，直至前述情形被得以合理纠正，或基于第3.2.1.3条的约定注销该账户。
            </p>
          </div>
          <div class="sub-tit">
            3.4您理解并同意，您名下如存在多个宜选建站账户，因您的违法、违规、违约行为导致其中一个或多个账户被冻结或注销的，宜选有权根据具体情形及相关风险程度作合理判断，对您的其他全部或部分账户予以冻结或注销。
          </div>
          <div class="l-tit">四、网站服务及规范</div>
          <div class="sub-tit">
            4.1.您有权享受宜选通过本网站提供的互联网技术服务和信息服务。您同时还应根据本服务协议以及您在购买具体云服务时确认的相关条款和条件，履行及时付款、服务管理等责任。
          </div>
          <div class="sub-tit">4.2.您使用宜选服务（包括本服务和云服务）时，您应保证：</div>
          <div class="l-box">
            <p>
              4.2.1.您使用宜选服务时将遵从国家、地方法律法规、行业惯例和社会公共道德，不会利用宜选提供的服务进行存储、发布、传播如下信息和内容：
            </p>
            <p>（ⅰ）违反国家法律法规政策的任何内容（信息）；</p>
            <p>（ⅱ）违反国家规定的政治宣传和/或新闻信息；</p>
            <p>（ⅲ）涉及国家秘密和/或安全的信息；</p>
            <p>（ⅳ）封建迷信和/或淫秽、色情、下流的信息或教唆犯罪的信息；</p>
            <p>（ⅴ）博彩有奖、赌博游戏；违反国家民族和宗教政策的信息；</p>
            <p>（ⅵ）妨碍互联网运行安全的信息；</p>
            <p>（ⅶ）侵害他人合法权益的信息和/或其他有损于社会秩序、社会治安、公共道德的信息或内容；</p>
            <p>
              （ⅷ）您同时承诺不得为他人发布上述不符合国家规定和/或本服务协议约定的信息内容提供任何便利，包括但不限于设置URL、BANNER链接等；
            </p>
            <p>
              4.2.2.不应出现任何破坏或试图破坏网络安全等的行为，包括不会利用技术或其他手段破坏或扰乱本网站及宜选其他客户的网站；
            </p>
            <p>
              4.2.3.您使用宜选建站平台的服务应符合本服务协议；<br />
              如您违反上述保证，宜选除有权根据相关服务协议采取删除信息、中止服务、终止服务的措施，并有权冻结或注销您账户部分或全部功能。
            </p>
            <p>
              4.2.4
              您了解并同意宜选会将您的网站资料同步到宜选网（www.ecer.com)及旗下的其它平台；您也了解并同意宜选可以使用您的网站资料在第三方平台上进行推广。
            </p>
          </div>
          <div class="sub-tit">4.3 关于宜选建站服务免费体验版</div>
          <div class="l-box">
            <p>
              4.3.1宜选建站服务免费体验版是指宜选未收取建站服务费用的服务，其对外名字包括不限于淘金旺站、免费旺站、免费建站服务等等；网站域名费用、服务器空间费用是第三方的服务，并不是宜选提供的服务，因此该部分收取了费用不能视同宜选建站服务收取了费用。
            </p>
            <p>
              4.3.2宜选建站服务免费体验版是宜选建站服务的一部分，该服务涉及到的域名客户可以购买，也可以使用宜选免费提供的域名；您了解并同意对于宜选免费提供的网站域名所有权、收益权、使用权归宜选所有；宜选也同意您购买的域名所有权、收益权、使用权归您所有。
            </p>
            <p>
              4.3.3您了解并同意，宜选可能在您免费体验版网站的部分页面或者全部页面上投放宜选网的广告或者第三方的联盟的广告（包括不限于谷歌、facebook等）；您了解并同意该部分广告的收益全部归宜选。
            </p>
            <p>
              4.3.4您了解并同意，宜选可能会对您的免费体验版网站进行推广，包括不限于SEO、广告投放等；您了解并同意宜选网进行推广时，可以使用您的网站资料。
            </p>
          </div>
          <div class="l-tit">五、隐私及个人信息的保护</div>
          <div class="l-box">
            <p>
              5.1.为及时跟进您的需求，我们可能会将您提供的联系人信息或账号数据（包含姓名、电子邮箱地址、电话号码、职务）、您的公司基本信息以及项目服务信息录入到我们的客户关系管理（CRM）系统，与您对接的服务顾问将有权限查看前述信息并在必要时与您进行联络。
            </p>
            <p>5.2.如您希望进一步了解我们如何收集、使用您的个人信息或如何保障您的隐私，您可参见宜选网隐私条款。</p>
          </div>
          <div class="l-tit">六、知识产权</div>
          <div class="l-box">
            <p>
              6.1.我们尊重知识产权，除非获得了您的同意，宜选不会擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表您拥有知识产权的成果。
            </p>
            <p>
              6.2.任何组织或个人认为宜选建站平台的网页内容，如转载文章、服务商发布的商品信息等可能侵犯其合法权益的，可向宜选提出书面权利通知，宜选将在收到知识产权权利人合格通知后依法尽快处理。
            </p>
            <p>
              6.3.除非另行说明，宜选建站平台Logo、“宜选”等文字、图形及其组合，以及宜选建站平台的其他标识、徽记、宜选服务的名称、技术文档等的知识产权为宜选及其关联公司所有。“知识产权”包括在专利法、著作权法、商标法、反不正当竞争法等法律中规定的任何和所有权利、所有权和利益，以及其中的任何和所有应用、更新、扩展和恢复。
            </p>
            <p>
              6.4.您不得攻击宜选官网及所有的IT系统，不得修改、改编、翻译云服务所使用的软件、技术、材料等，不得通过反向工程、反编译、反汇编或其他类似行为获得云服务涉及的源代码，否则由此引起的一切法律后果由您负责，宜选有权依法追究您的法律责任。
            </p>
            <p>
              6.5.您应尊重宜选和第三方的知识产权和其他合法权利/权益，并保证在发生侵犯前述权益的违法事件时，保护宜选及其雇员、股东、合作伙伴等免于因该等事件受到影响或损失，宜选保留在您侵犯宜选及/或其他第三方的合法权利/权益时终止向您提供服务并不退还任何款项的权利。
            </p>
          </div>
          <div class="l-tit">七、保密</div>
          <div class="l-box">
            <p>宜选承诺对您注册账户时或使用宜选服务时提交或知悉的信息采取保密措施，不向第三方披露您的信息，除非：</p>
            <p>7.1.依据本服务协议或者您与宜选之间其他服务协议、合同、在线条款等规定可以提供的；</p>
            <p>7.2.依据法律法规的规定或行政、司法等职权部门要求应当提供的；</p>
            <p>7.3.在不违反本服务协议约定责任的前提下，该保密信息已经公开或能从公开领域获得；</p>
            <p>7.4.为提供您要求的服务所必需。</p>
          </div>
          <div class="l-tit">八、出口管制</div>
          <div class="l-box">
            <p>
              双方承诺遵守本协议所适用的联合国、中国、美国以及其他国家出口管制法律法规。您承诺不会将宜选提供的产品或服务用于适用的出口管制法律法规禁止的用途。非经相关主管机关许可，您及您授权使用宜选产品或服务的其他个人或实体不会通过宜选产品或服务向适用的出口管制法律法规禁止的实体或个人提供受管控的技术、软件或服务。
            </p>
          </div>
          <div class="l-tit">九、信息安全事件</div>
          <div class="l-box">
            <p>
              宜选将依据国家法律法规的要求、遵照相关安全事件处理标准管理信息安全事件。当发生涉及您相关资产的信息安全事件时，我们会依法及时将事件相关的情况通过邮件、短信、电话、推送通知等方式告知，您也可通过工单、专属客服、大客户经理电话等方式主动联系我们。
            </p>
          </div>
          <div class="l-tit">十、责任范围和责任限制</div>
          <div class="l-box">
            <p>
              10.1.您了解并同意，您应承担因您使用本服务、违反本服务协议或在您的账户下采取的任何行动而导致的任何第三方索赔。如果由此引起宜选及其关联公司、员工、客户和合作伙伴被第三方索赔的，您应负责处理，并赔偿宜选及其关联公司由此遭受的全部损失和责任。
            </p>
            <p>
              10.2.在适用法律许可的范围内，宜选不对与本服务协议有关或由本服务协议引起的任何间接的、惩罚性的、特殊的、派生的损失承担赔偿责任。
            </p>
            <p>
              10.3.宜选在此提示，您在使用宜选服务期间应当遵守中华人民共和国的法律，不得危害网络安全，不得利用宜选的服务从事侵犯他人名誉、隐私、知识产权和其他合法权益的活动。宜选不对您使用宜选服务的违法或违约行为承担任何责任。
            </p>
            <p>
              10.4.您在宜选建站平台上自行上传、提供、发布相关信息，包括但不限于用户名称、公司名称、联系人及联络信息，相关图片、资讯等，均由您自行提供，您须对其提供的前述信息依法承担全部责任。
            </p>
            <p>
              10.5.在某些情况下，为了帮助您更便捷的使用宜选服务，宜选可能会展示宜选的参考代码或软件（如属于第三方开源软件，您则应遵守第三方开源软件的相关使用要求），基于相应展示页面的使用说明，该等软件可能允许您予以下载、进行二次开发等相关操作，您应理解并承诺，该等代码的知识产权属于宜选，您在使用时应明确表明权利人，同时，宜选不对您能否使用以及使用该等代码、软件的工作和后果负责。
            </p>
          </div>
          <div class="l-tit">十一、不可抗力和意外事件</div>
          <div class="l-box">
            <p>
              宜选的网站及云服务是按照现有技术和条件所能达到的现状提供的，宜选会尽最大努力保障服务的连贯性和安全性，但不能随时预见和防范法律、技术以及其他风险，在法律允许的范围内，如因下列不可抗力或意外事件无法正常提供服务的，宜选不承担任何法律责任：
            </p>
            <p>
              11.1.不可抗力，即双方所不能预见、并且它的发生及其后果是不能克服和不能避免的客观情况，包括但不限于如下情形：(1)自然灾害如洪水、冰雹、海啸、台风、旱灾、火灾；(2)社会因素如罢工、暴乱、战争及所适用的政策、法律、法规导致不能履行；
            </p>
            <p>11.2.因电力供应故障、通讯网络故障等公共服务因素；</p>
            <p>11.3.因黑客攻击、病毒、您自身软硬件设备异常等非宜选独立责任；</p>
            <p>
              11.4.经提前公告或通知的，宜选在短时间内的系统维护（包括但不限于排除故障、系统升级、系统扩容、服务器迁移）。
            </p>
          </div>
          <div class="l-tit">十二、法律适用与管辖</div>
          <div class="l-box">
            <p>
              本服务协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。因本服务协议产生之争议应提交至（中国北京市朝阳区）有管辖权的人民法院解决。
            </p>
          </div>
          <div class="l-tit">十三、通知送达</div>
          <div class="l-box">
            <p>
              13.1.您理解并同意，宜选可通过网页公告、电子邮件、站内信、短信、电话、系统消息以及即时通信等以上一种或多种通知方式向您发送通知，且宜选可以信赖您所提供的联系信息是完整、准确且当前有效的；上述通知在发送成功后视为已送达。
            </p>
            <p>
              13.2．除非本服务协议另有约定或宜选与您另行签订的协议明确规定了通知方式，您发送给宜选的通知，应当通过宜选对外正式公布的通信地址、传真号码、电子邮件地址等联系信息进行送达。
            </p>
          </div>
          <div class="l-tit">十四、条款的更新和终止</div>
          <div class="l-box">
            <p>
              14.1.宜选有权对本服务协议及相应的服务规则内容进行变更，并将网页公告、电子邮件、站内信、短信等方式予以公告或通知；若您在本服务协议内容变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的内容，也将遵循修改后的条款内容。
            </p>
            <p>14.2.在您的账户注销或经双方协商一致终止网站服务的，本服务协议终止。</p>
          </div>
          <div class="l-tit">十五、其他</div>
          <div class="l-box">
            <p>
              15.1.本服务协议由本服务协议的内容、网站相关页面上展现的规则、规范，服务说明（含操作文档）和您点击确认的其他条款/条件组成，宜选和您均受其约束，且其中的相关名词可相互引用、解释。
            </p>
            <p>15.2.本服务协议的章节标题仅为行文方便而设，不具有法律或合同效力。</p>
            <p>
              15.3.本服务协议任一条款被视为废止、无效或不可执行，该条款应视为可分的且不影响本服务协议及其他条款的有效性及可执行性。
            </p>
            <p>
              15.4.宜选有权在宜选官网上发布公告、发站内通知或邮件通知等方式将本服务的权利义务全部或者部分转移给宜选的关联公司。
            </p>
            <p>
              15.5.除另有约定外，出于服务专业性考虑，宜选亦可能委托关联公司或其他法律主体向您提供宜选建站平台上一项或多项具体服务，同时您可能会与该等公司订立相关条款或条件，请您审慎阅读、充分理解条款和条件内容，选择接受或不接受该条款和条件。
            </p>
            <p>
              15.6.本服务协议项下之保密条款、知识产权条款、法律适用与管辖条款以及性质上理应存续的其他条款（如对注册信息的真实性保证等），不因本条款的终止而失效。
            </p>
            <p>
              15.7.宜选将严格遵守自愿、平等、公平、诚信的合作原则，充分尊重合作方的自主经营权利。如发现宜选员工存在违反上述合作原则的不当行为，宜选将遵循保密、客观的原则开展调查和处理。
            </p>
          </div>
        </div>
      </div>
      <div class="agree-btn-wrap">
        <div class="l-btn" @click="agreeFn">同意</div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts" name="Guide1">
import { reactive, ref } from 'vue'
import { useRouter, useRoute } from 'vue-router'
import { useUserStore, useNavTabStore } from '@/store'
import { useLoading } from '@/hooks'
import { Message, Form } from '@arco-design/web-vue'
import { guideProve } from '@/apis'
const route = useRoute()
const router = useRouter()
const userStore = useUserStore()
const navTabStore = useNavTabStore()
const agreeFn = async () => {
  const res = await guideProve()
  const companyname = ref(route.query.company_name || '')
  if (res.code == 0) {
    router.push({ path: '/guide1', query: { company_name: companyname.value } })
  }
}
</script>

<style lang="scss" scoped>
@import './mod/index.scss';
.agree-box {
  border-radius: 8px;
  box-shadow: 0px 4px 16px 0px rgba(98, 87, 255, 0.16);
  background: rgb(255, 255, 255);
  position: absolute;
  box-sizing: border-box;
  top: 48px;
  left: 50%;
  bottom: 48px;
  transform: translateX(-50%);
  border-radius: 8px;
  width: 1000px;
  padding: 24px 32px 32px 32px;
  display: flex;
  flex-direction: column;
  .scroll-box {
    overflow: auto;
    height: calc(100vh - 336px);
    margin-right: -25px;
    padding-right: 20px;
  }
  .agree-content {
    color: rgb(78, 89, 105);
    font-size: 14px;
    font-weight: 400;
    line-height: 22px;
    a {
      color: rgb(65, 84, 179);
      text-decoration: none;
    }
    .img-box {
      text-align: center;
      img {
        width: 134px;
      }
    }

    .main-tit {
      color: rgb(29, 33, 41);
      font-size: 24px;
      font-weight: 400;
      line-height: 32px;
      text-align: center;
      margin-top: 12px;
      margin-bottom: 32px;
      font-weight: bold;
    }
    .sub-tit {
      color: rgb(29, 33, 41);
      font-size: 14px;
      font-weight: 400;
      line-height: 22px;
      margin-bottom: 8px;
      font-weight: bold;
    }
    .l-tit {
      color: rgb(29, 33, 41);
      font-size: 20px;
      font-weight: 400;
      line-height: 28px;
      margin-bottom: 16px;
      font-weight: bold;
    }
    p {
      margin-bottom: 8px;
    }
    .l-box {
      margin-bottom: 32px;
      p:last-child {
        margin-bottom: 0;
      }
    }
  }
}
</style>
